{"posts":[{"title":"Website Construction Process","text":"🤔 For my first blog post, I want to write about my website construction process, hoping to provide some inspiration for others who want to build their own sites. Prerequisites A computer with internet connection A GitHub account (I logged in directly with my Google account) A pair of nimble hands A smart little brain O(∩_∩)O Installing SoftwareInstalling Software Deploying Blog with Hexo + GitHub PagesDeploying Blog with Hexo + GitHub Pages Writing and Publishing Your First Blog Post to GitHub Pages with HexoWriting and Publishing Your First Blog Post to GitHub Pages with Hexo","link":"/49874/"},{"title":"Celebrating National Day — Together for Our Motherland","text":"The Splendor of the Land and the Joy of Celebration — Written on the Eve of National Day 🎉🇨🇳As autumn breezes sweep across the vast land of China and the morning glow paints the mountains in red, we once again welcome a meaningful moment — October 1st, National Day, the birthday of the People’s Republic of China. On this day, no special ceremony is needed — the feeling of patriotism quietly rises in every heart. Look around: on the bustling city streets, the Five-Star Red Flags wave proudly under the golden sun; in peaceful villages, crimson flags flutter above smoke curling from chimneys — humble but heartfelt signs of joy. Shop windows glow with “China Red” decorations, children wave little flags, and social media overflows with “I love you, China.” These small yet heartwarming moments come together to form the ritual beauty of this festival, turning “National Day” from a date on the calendar into a shared emotional memory for every Chinese person. We often say that National Day is more than a holiday — it is a mirror that lets us look back at history. It reminds us of the solemn declaration over 70 years ago: “The Central People’s Government of the People’s Republic of China is established!” It recalls generations of hard work and perseverance that carried the nation from poverty to prosperity. At the same time, it is also a beacon of the future, reminding us that today’s peace and comfort are built upon the sweat and dedication of countless people — and that the journey toward a better tomorrow continues with our shared efforts. On this glorious and hopeful day, there is so much to say from the heart: Gratitude to our Motherland, whose strength provides us a safe and stable home. From border defense to daily life, from technological breakthroughs to social progress — it is the steady rise of our nation that gives us the confidence to stand tall in the world and pursue happiness fearlessly. Gratitude for everyday life, where beauty hides in simplicity — a warm breakfast at dawn, a cozy dinner with family, the convenience of travel, a peaceful walk in the park. These small joys are threads in the fabric of happiness, reminding us that “when the country prospers, the people thrive.” Hope for growing with our nation — though we may be ordinary individuals in our roles, every bit of hard work, every act of kindness, every moment of diligence contributes to the nation’s progress. May we all paint our own stories on the canvas of our era, walking alongside our country toward a brighter future. Finally, let us offer our sincerest blessings — to our beloved country, and to everyone striving for a better life: 🎆 May our Motherland remain splendid and prosperous for generations to come. May you have a joyful and peaceful National Day filled with happiness and strength! 🎆","link":"/91327/"},{"title":"The Origin and Blessings of the Mid-Autumn Festival","text":"🌕 The Origin and Blessings of the Mid-Autumn FestivalThe Mid-Autumn Festival, also known as the Moon Festival or Mooncake Festival, is one of China’s four major traditional holidays. It originated from ancient moon worship and autumn harvest celebrations. According to historical records, it became an official festival during the Tang Dynasty and was widely celebrated among the people by the Song Dynasty. On this day, families gather to admire the moon, eat mooncakes, and celebrate reunion. The famous legend of Chang’e flying to the moon adds a touch of romance to this festival. Over time, the moon came to symbolize homesickness, longing, and family reunion — making the Mid-Autumn Festival a celebration of togetherness and affection. 🥮 Traditional Customs Moon Gazing: Admiring the bright full moon and expressing love and longing for distant family members. Eating Mooncakes: Representing unity, happiness, and completeness. Riddle Guessing: A fun and meaningful activity that brings joy and wisdom to the festival. 🎉 Festival WishesOn this beautiful night of the full moon, may you have: ✨ Success in your career and sweetness in life;🌸 Happiness in your family and good health always;🌕 Wishes fulfilled and hearts united! Happy Mid-Autumn Festival! 🌕🥮 📜 The Mid-Autumn Festival is a time of warmth and reunion. No matter where you are, may the moonlight carry your thoughts and blessings to your loved ones.","link":"/32785/"},{"title":"Installing Software","text":"Installing Software Step 1: Install Git Download Git After installation, press Win + R, type cmd and open it. Run the following command to verify installation:1git --version If a version number appears, Git is successfully installed. Step 2: Install Node.js Download Node.js After installation, open cmd and run:12node -vnpm -v If version numbers appear, Node.js and npm are successfully installed. (Optional) To update npm to the latest version:1npm install -g npm Step 3: Install Hexo CLI (for Windows) Open cmd with administrator privileges. Run the following command to install Hexo CLI globally:1npm install -g hexo-cli Create a new folder to store your blog files and navigate to it:123hexo init blogcd blognpm install Start the Hexo server:1hexo server Open http://localhost:4000 in your browser to preview your blog.To stop the server, press Ctrl + C in the terminal. ImagesMake sure your image file is located in source/images/1.png:","link":"/10422/"},{"title":"Welcome to Yu&#39;s Tech Blog!","text":"Hello and welcome to my tech blog! 🎉 A Warm WelcomeI’m thrilled to have you here on my digital journey through the world of web development and programming. This is Yu’s Tech Blog - a space where I share my learning experiences, coding adventures, and technical discoveries as a passionate 17-year-old developer. What This Blog Is AboutThis blog serves as my public learning diary where I document: 🚀 Learning Journey My experiences with different programming languages Challenges I face and how I overcome them New technologies I’m exploring Growth milestones in my development career 💻 Technical Content Tutorials: Step-by-step guides on web development topics Project Breakdowns: Deep dives into projects I’ve built Tool Reviews: My thoughts on development tools and resources Best Practices: Tips and tricks I’ve learned along the way 🌱 Personal Growth Reflections on learning to code as a student Balancing school and programming Building projects and gaining real-world experience Connecting with the developer community Why I Started This BlogAs a young developer, I believe in learning in public. Here’s why I decided to share my journey: Documentation: Writing helps me solidify what I learn Community: Connecting with fellow developers and learners Accountability: Keeping track of my progress and goals Giving Back: Sharing knowledge with others who might benefit What You Can ExpectI’ll be regularly posting about: Web Development: Frontend and backend technologies Programming Languages: JavaScript, Python, and more Project Showcases: Things I build and lessons learned Learning Resources: Books, courses, and tools I recommend Career Insights: Advice for fellow student developers Current Focus AreasRight now, I’m particularly focused on: Mastering JavaScript and modern frameworks Building full-stack web applications Learning best practices in software development Exploring open source contributions Understanding web performance and optimization Let’s Connect!I’d love to hear from you! Whether you’re: A fellow student learning to code An experienced developer with advice Someone curious about programming Or just stopping by to say hello Feel free to reach out through: Comments on blog posts GitHub: Check out my projects and contributions Email: Drop me a line with questions or suggestions Social Media: Let’s connect and share our coding journeys What’s Next?I’m excited to share more content with you! Coming up: A detailed guide on setting up a development environment My first major project walkthrough Reviews of learning resources that helped me Tips for balancing coding with school life Thank you for joining me on this adventure! I hope you find the content helpful and inspiring. Let’s learn, build, and grow together in this amazing world of technology! Happy coding! 🚀 Yu","link":"/32793/"},{"title":"Writing and Publishing Your First Blog with Hexo on GitHub Pages","text":"In the previous article, we completed the basic setup of Hexo and successfully deployed the site to GitHub Pages. Today, let’s write your first blog post and publish it online. 1. Create a New PostRun the following command in your Hexo project root directory: 1hexo new post &quot;My First Blog&quot; This will generate a Markdown file under source/_posts/ named My First Blog.md. You can open it with your favorite editor (such as VS Code) and start writing: 123456789---title: My First Blogdate: 2025-09-21 12:00:00tags: [Essay, Hexo]---This is my first blog post written with Hexo!I’ll be sharing more technical tutorials here in the future. 2. Preview LocallyOnce finished, start the local Hexo server to preview the result: 1hexo s Visit http://localhost:4000 in your browser — you should see your new post on the homepage. 3. Generate Static FilesIf everything looks fine, generate the static files: 1hexo generate (Shortcut: hexo g) The generated files will be stored in the public/ folder. 4. Deploy to GitHub PagesFinally, deploy your blog online by running: 1hexo deploy (Shortcut: hexo d) After a few seconds, you’ll be able to access your post at your GitHub Pages address, e.g.:https://yourusername.github.io/ 5. SummaryHere’s the full workflow of writing and publishing a Hexo post on GitHub Pages: hexo new post &quot;Post Title&quot; → Create a new post Edit the post content hexo s → Preview locally hexo g → Generate static files hexo d → Deploy to GitHub Pages Always run hexo clean before deploying to clear old cache! Simple, right? 🎉Now you can continue writing more posts or start customizing your theme!","link":"/32784/"},{"title":"Deploying a Hexo Blog on GitHub Pages — A Complete Guide","text":"When it comes to building a personal blog, Hexo + GitHub Pages is one of the most popular solutions.This guide walks you through every step, from setup to deployment, helping you create your own online blog quickly and easily. 1. Connect Git to GitHub (SSH Recommended)During deployment, we need to enable communication between your local environment and GitHub. It’s recommended to use SSH to avoid typing your credentials every time. Open your terminal (Git Bash on Windows, Terminal on macOS/Linux) and generate an SSH key: 1ssh-keygen -t rsa -C &quot;your_email@example.com&quot; Replace your_email@example.com with your GitHub account email. Press Enter three times to accept defaults — your key will be saved in: Windows: C:\\Users\\YourName\\.ssh macOS/Linux: ~/.ssh Locate the id_rsa.pub file (the public key), open it with a text editor, and copy the contents. Go to GitHub → Settings → SSH and GPG keys → New SSH key Title: something like “My PC” Key: paste your public key Click Add SSH key Test your connection: 1ssh -T git@github.com Type yes if prompted. If you see: Hi username! You've successfully authenticated... Then the SSH setup is complete. 2. Configure Hexo Deployment to GitHubAfter connecting GitHub, edit your Hexo configuration file to enable automatic deployment. 1. Edit _config.ymlAt the end of the file, locate the deploy section and modify it like this: 1234deploy: type: git repo: https://github.com/username/username.github.io.git # Or SSH: git@github.com:username/username.github.io.git branch: main 2. Install Deployment PluginRun the following command in your Hexo project directory: 1npm install hexo-deployer-git --save 3. Configure Git User InfoSet your global Git username and email (first-time setup only): 12git config --global user.name &quot;yourname&quot;git config --global user.email &quot;youremail@example.com&quot; Verify your configuration: 12git config user.namegit config user.email 3. Publish Blog to GitHub PagesOnce everything is configured, you can push your blog to GitHub Pages. Create a Test Post (optional): 1hexo new &quot;My First Hexo Blog&quot; Generate Static Files: 12hexo cleanhexo g Deploy to GitHub: 1hexo d Visit Your Blog: Wait 1–5 minutes, then open: https://username.github.io 4. Common Issues &amp; Fixes Can’t Find GitHub Username?Your username is the part after / in your GitHub profile URL. Example:https://github.com/octocat → username is octocat. Git Configuration ProblemsBe sure there’s a space between user.name and &quot;yourname&quot; when setting values: 12git config --global user.name &quot;yourname&quot;git config --global user.email &quot;youremail@example.com&quot; Upload Failed or TimeoutYou may need to set up a proxy or use SSH for better stability. SummaryNow you’ve learned how to: Connect to GitHub using SSH Configure Hexo for automatic deployment Use hexo g and hexo d to publish your blog online Congratulations — your personal Hexo blog is live! 🚀","link":"/56213/"},{"title":"Recommended Python Programming Tools (Including Pricing and Download Links)","text":"Recommended Python Programming Tools (Including Pricing and Download Links)When learning Python, having the right programming tool can greatly improve efficiency and experience. Whether you’re a beginner writing your first line of code or a developer working on complex projects, choosing the right tool is very important. Below, I’ll introduce several common Python programming tools with pricing information and official download addresses for quick access. 1. Python Official IDE (IDLE)IDLE is the official development tool that comes with Python. You can use it directly after installing Python without additional configuration. Advantages: Zero configuration, simple and easy to use, built-in interactive window. Disadvantages: Limited functionality, lacks intelligent suggestions and plugins. Pricing: Completely free. Official Download: https://www.python.org/downloads/ Target Users: Python beginners. 2. VS CodeVisual Studio Code (VS Code) is currently one of the most popular code editors with excellent Python support. Advantages: Lightweight, rich plugins, cross-platform. Disadvantages: Powerful features but requires manual plugin installation and configuration. Pricing: Completely free. Official Download: https://code.visualstudio.com/ Target Users: Most Python learners and developers. 3. PyCharmPyCharm is a professional Python IDE from JetBrains with very powerful features. Advantages: Complete code completion, debugging, testing, virtual environment management, suitable for large projects. Disadvantages: Resource-heavy, high resource consumption. Pricing: Community Edition: Free Professional Edition: Paid, personal subscription about $89/year Official Download: https://www.jetbrains.com/pycharm/download/ Target Users: Intermediate to advanced developers who need a complete development environment. 4. Jupyter NotebookJupyter Notebook is a commonly used tool in data science and machine learning fields. Advantages: Interactive programming, supports mixed display of code, text, and charts, perfect for experiments and process documentation. Disadvantages: Not suitable for large project development. Pricing: Completely free (open source), cloud-based advanced GPU/TPU resources may be paid. Official Download: https://jupyter.org/install Target Users: Data scientists, researchers, students. 5. ThonnyThonny is a Python IDE designed for beginners with a clean interface and simple functionality. Advantages: User-friendly interface, built-in debugger, lightweight, easy installation. Disadvantages: Limited functionality, not suitable for large project development. Pricing: Completely free. Official Download: https://thonny.org/ Target Users: Programming beginners, educational scenarios. 6. Turtle EditorTurtle Editor is a fun tool for Python beginners, commonly used for teaching and graphics. Advantages: Visually demonstrates code effects through turtle graphics, highly engaging. Disadvantages: Limited functionality, not suitable for complex development. Pricing: Free. Official Download: https://python-course.eu/python-turtle.php Target Users: Children, programming beginners. 7. Sublime TextSublime Text is a lightweight, fast editor that supports Python. Advantages: Fast speed, supports multiple languages, clean interface. Disadvantages: Features require plugin supplementation, Python experience not as good as VS Code. Pricing: Unlimited free trial, official license about $99. Official Download: https://www.sublimetext.com/ Target Users: Users who prefer clean editors. Tool Comparison Table Tool Pricing Difficulty Feature Range Target Users Official Download IDLE Free ★ Basic programming Beginners Python Official VS Code Free ★★ Plugin extensions, suitable for various development Most learners and developers VS Code Official PyCharm Free (Community)/Paid (Professional) ★★★ Complete IDE, enterprise development Intermediate to advanced developers PyCharm Official Jupyter Notebook Free (local/basic cloud)/Partially paid ★★ Data science, machine learning Data science, researchers Jupyter Official Thonny Free ★ Simple teaching IDE Beginners Thonny Official Turtle Editor Free ★ Visual graphics Beginners Turtle Official Sublime Text Trial/Paid ★★ Lightweight editor Users seeking simplicity Sublime Official Summary Want simple quick start: Use IDLE or Thonny directly. Want powerful free tools: Recommend VS Code. Want professional IDE: Choose PyCharm (Professional paid, Community free). Want data science/machine learning: Use Jupyter Notebook. Want fun learning: Try Turtle Editor. Want lightweight coding: Try Sublime Text. Choosing the right tool not only improves programming efficiency but also makes learning more enjoyable. Hope this article helps you find the most suitable Python programming companion! ✍️ Which Python tool do you use most often? Welcome to share your experience in the comments!","link":"/63190/"}],"tags":[{"name":"Tutorial","slug":"Tutorial","link":"/tags/Tutorial/"},{"name":"Blog Setup","slug":"Blog-Setup","link":"/tags/Blog-Setup/"},{"name":"National Day","slug":"National-Day","link":"/tags/National-Day/"},{"name":"Festival","slug":"Festival","link":"/tags/Festival/"},{"name":"Mid-Autumn Festival","slug":"Mid-Autumn-Festival","link":"/tags/Mid-Autumn-Festival/"},{"name":"Chinese Festival","slug":"Chinese-Festival","link":"/tags/Chinese-Festival/"},{"name":"Moon Culture","slug":"Moon-Culture","link":"/tags/Moon-Culture/"},{"name":"Reunion","slug":"Reunion","link":"/tags/Reunion/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Comments","slug":"Comments","link":"/tags/Comments/"},{"name":"Blog","slug":"Blog","link":"/tags/Blog/"},{"name":"welcome","slug":"welcome","link":"/tags/welcome/"},{"name":"introduction","slug":"introduction","link":"/tags/introduction/"},{"name":"tech blog","slug":"tech-blog","link":"/tags/tech-blog/"},{"name":"Blogging","slug":"Blogging","link":"/tags/Blogging/"},{"name":"GitHub Pages","slug":"GitHub-Pages","link":"/tags/GitHub-Pages/"},{"name":"GitHub","slug":"GitHub","link":"/tags/GitHub/"},{"name":"Deployment","slug":"Deployment","link":"/tags/Deployment/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"VSCode","slug":"VSCode","link":"/tags/VSCode/"},{"name":"IDE","slug":"IDE","link":"/tags/IDE/"},{"name":"PyCharm","slug":"PyCharm","link":"/tags/PyCharm/"},{"name":"Jupyter","slug":"Jupyter","link":"/tags/Jupyter/"},{"name":"Editor","slug":"Editor","link":"/tags/Editor/"}],"categories":[{"name":"Blog Tutorial","slug":"Blog-Tutorial","link":"/categories/Blog-Tutorial/"},{"name":"Essay","slug":"Essay","link":"/categories/Essay/"},{"name":"Traditional Culture","slug":"Traditional-Culture","link":"/categories/Traditional-Culture/"},{"name":"Blog","slug":"Blog","link":"/categories/Blog/"},{"name":"General","slug":"General","link":"/categories/General/"},{"name":"Python","slug":"Python","link":"/categories/Python/"},{"name":"Tutorial","slug":"Blog/Tutorial","link":"/categories/Blog/Tutorial/"},{"name":"Tool Recommendations","slug":"Python/Tool-Recommendations","link":"/categories/Python/Tool-Recommendations/"}],"pages":[{"title":"About","text":"About MeHi there! 👋 Welcome to my tech blog! Who Am I?I’m Yu, a passionate 17-year-old high school student with a deep love for web development and programming. This blog is my digital playground where I share my learning journey, coding experiments, and technical discoveries. What You’ll Find HereOn this blog, you’ll discover: 📚 Learning Notes: My experiences learning various programming languages and frameworks 🛠️ Project Showcases: Cool projects I’ve built and lessons learned 💡 Technical Tutorials: Step-by-step guides on web development topics 🔧 Tool Reviews: My thoughts on development tools and resources 🌱 Growth Journey: Reflections on my path as a young developer My Tech StackCurrently exploring and working with: Frontend: HTML, CSS, JavaScript, React Backend: Node.js, Python Tools: VS Code, Git, GitHub Frameworks: Hexo, Express.js Learning: TypeScript, Vue.js, databases Why I BlogI believe in learning in public and sharing knowledge with the community. Writing about what I learn helps me: 🎯 Solidify my understanding 📈 Track my progress 🤝 Connect with fellow developers 💪 Give back to the amazing dev community Get In TouchI’d love to connect with fellow developers and learners! GitHub: Jiayu Email: rossiniortensia@gmail.com Twitter: @Jiayu_aaa Fun Facts 🎓 Currently in high school while coding in my free time 🌍 Based on Earth (obviously! 😄) 📱 Started coding with simple HTML pages 🎮 Love both creating and playing games 🎵 Often code while listening to lo-fi music Thanks for visiting my blog! Feel free to leave comments and share your thoughts. Let’s learn and grow together in this amazing world of technology! Blog Tech Stack: This blog is built with Hexo and hosted on GitHub Pages. The theme is Icarus.","link":"/about/"},{"title":"Privacy Policy","text":"Privacy PolicyWe value your privacy. This page explains what data we collect, how we use it, and your rights. Data Collection We do not collect personal data without your consent. Google Analytics and other third-party services may collect anonymous usage data. Cookies We may use cookies to improve your browsing experience. You can disable cookies in your browser settings. Third-Party Services We use Google AdSense for ads. We use analytics services like Google Analytics and Microsoft Clarity. ContactFor questions about this privacy policy, please contact us at your email address.","link":"/privacy-policy/"}]}